## 정렬(sort)

- 데이터 정렬
- 기준
    - 인덱스 => sort_index()
    - 값 => sort_value()

In [2]:
# 모듈 로딩
import pandas as pd
import numpy as np   # nan 사용

# 데이터 생성
df=pd.DataFrame({'value':[4, 1, 2, 3, 5],
                'name':['John Kim', 'GilDong Hong', 'Tom', 'Lee', 'Annan Jung'],
                'age':[12, np.nan, 10, 6, np.nan]})

# 데이터 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   value   5 non-null      int64
 1   name    5 non-null      object
 2   age     3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

In [3]:
# 인덱스 & 컬럼 확인
print(df.index, df.columns, sep='\n')

RangeIndex(start=0, stop=5, step=1)
Index(['value', 'name', 'age'], dtype='object')

In [6]:
# 정렬하기
# [기본] 오름차순 ----> ascending 파라미터 = False : 내림차순
df.sort_index(ascending=False)

   value          name   age
4      5    Annan Jung   NaN
3      3           Lee   6.0
2      2           Tom  10.0
1      1  GilDong Hong   NaN
0      4      John Kim  12.0

In [9]:
# 특정 컬럼 기준 정렬 => sort_values()
# name 컬럼으로 정렬
df.sort_values(by='name')

   value          name   age
4      5    Annan Jung   NaN
1      1  GilDong Hong   NaN
0      4      John Kim  12.0
3      3           Lee   6.0
2      2           Tom  10.0

In [10]:
# name 컬럼을 기준으로 내림차순 정렬
df.sort_values(by='name', ascending=False)

   value          name   age
2      2           Tom  10.0
3      3           Lee   6.0
0      4      John Kim  12.0
1      1  GilDong Hong   NaN
4      5    Annan Jung   NaN